experiments/Qwen3-Coder-30B-A3B-Instruct-AWQ/optimal_mcr_rtx5090/2026-02-24_23-11-42_0eea8a45/rtx5090_c20_n20_mcr20_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     20        
Failed requests:                         0         
Maximum request concurrency:             20        
Benchmark duration (s):                  76.63     
Total input tokens:                      80000     
Total generated tokens:                  80000     
Request throughput (req/s):              0.26      
Output token throughput (tok/s):         1044.03   
Peak output token throughput (tok/s):    1480.00   
Peak concurrent requests:                20.00     
Total token throughput (tok/s):          2088.06   
---------------Time to First Token----------------
Mean TTFT (ms):                          2212.82   
Median TTFT (ms):                        2175.79   
P99 TTFT (ms):                           4222.39   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.30     
Median TPOT (ms):                        16.08     
P99 TPOT (ms):                           18.03     
---------------Inter-token Latency----------------
Mean ITL (ms):                           16.30     
Median ITL (ms):                         15.14     
P99 ITL (ms):                            17.73     
==================================================