experiments/Qwen3-Coder-30B-A3B-Instruct-AWQ/optimal_mcr_rtx5090/2026-02-24_23-11-42_0eea8a45/rtx5090_c24_n24_mcr24_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     24        
Failed requests:                         0         
Maximum request concurrency:             24        
Benchmark duration (s):                  91.86     
Total input tokens:                      96000     
Total generated tokens:                  96000     
Request throughput (req/s):              0.26      
Output token throughput (tok/s):         1045.10   
Peak output token throughput (tok/s):    1752.00   
Peak concurrent requests:                24.00     
Total token throughput (tok/s):          2090.20   
---------------Time to First Token----------------
Mean TTFT (ms):                          2672.43   
Median TTFT (ms):                        2618.22   
P99 TTFT (ms):                           5172.61   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.91     
Median TPOT (ms):                        16.87     
P99 TPOT (ms):                           21.61     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.91     
Median ITL (ms):                         15.15     
P99 ITL (ms):                            19.98     
==================================================